Revit 2026 API

# FluidTemperatureSetIterator Class

---

An iterator to a set of FluidTemperature from FluidType.

SystemObject Autodesk.Revit.DB.PlumbingFluidTemperatureSetIterator

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FluidTemperatureSetIterator : IEnumerator<FluidTemperature>
```
```vb
Public Class FluidTemperatureSetIterator
	Implements IEnumerator(Of FluidTemperature)
```
```cpp
public ref class FluidTemperatureSetIterator : IEnumerator<FluidTemperature^>
```
```fsharp
type FluidTemperatureSetIterator =
    class
        interface IEnumerator<FluidTemperature>
    end
```

The FluidTemperatureSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FluidTemperatureSetIterator |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCurrent | Returns the current FluidTemperature. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsDone | Identifies if the iteration has completed. |
|  | MoveNext | Increments the iterator to the next item. |
|  | Reset | Resets the iterator to the initial state. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Plumbing Namespace